app/Models/Cadspedido_model.php

SELECT *
FROM `tb_pedido`
WHERE `id_pedido` = '56'
 LIMIT 1
---
    function deleta($id){
        return $this->where(['id_pedido' => $id])->delete();