app/Models/Cadspedido_model.php

    public function getPedido($id = false) {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `tb_pedido`