app/Models/Cadsproduto_model.php

SELECT *
FROM `tb_produto`
---
    public function getProduto($id = false) {
        if ($id === false) {
            return $this->findAll();